;************************************************************************************************************
; SPARTAN-II CLASS
;************************************************************************************************************
[SPARTAN-II_SSV X2SoldierClassTemplate]
+DisplayName="高级斯巴达"
+ClassSummary="高级斯巴达 计划，最初被称为超级士兵项目第二代，是斯巴达计划的一部分，该计划旨在通过机械和生物增强来培养精英士兵。高级斯巴达 计划将是该系列中第一个将先进的外骨骼技术与士兵的优越体格相结合的计划。"
+LeftAbilityTreeTitle="斯巴达"
+RightAbilityTreeTitle="增强"
+AbilityTreeTitles[0]="高级斯巴达"
+AbilityTreeTitles[1]="狙击手"
+AbilityTreeTitles[2]="枪手"
+AbilityTreeTitles[3]="爆破专家"
+AbilityTreeTitles[4]="重炮手"
+AbilityTreeTitles[5]="侦察员"
+AbilityTreeTitles[6]="刀锋大师"


;ALPHABETICAL ORDER
+RandomNickNames[0]="恶魔"
+RandomNickNames[1]="屠夫"
+RandomNickNames[2]="执法者"
+RandomNickNames[3]="百夫长"
+RandomNickNames[4]="监狱长"
+RandomNickNames[5]="突袭"
+RandomNickNames[6]="征服者"
+RandomNickNames[7]="军阀"
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]="女武神"
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""

+RankNames[0]="船员招聘"
+RankNames[1]="船员学徒"
+RankNames[2]="船员"
+RankNames[3]="三等士官"
+RankNames[4]="二级士官"
+RankNames[5]="一级士官"
+RankNames[6]="首席士官"
+RankNames[7]="高级首席士官"
+RankNames[8]="精英首席士官"

+ShortNames[0]="CR"
+ShortNames[1]="CA"
+ShortNames[2]="CN"
+ShortNames[3]="PO3"
+ShortNames[4]="PO2"
+ShortNames[5]="PO1"
+ShortNames[6]="CPO"
+ShortNames[7]="SCPO"
+ShortNames[8]="MCPO"

;************************************************************************************************************
; Nanosuit CLASS
;************************************************************************************************************
[Nanosuit_SSV X2SoldierClassTemplate]
+DisplayName="纳米尖兵"
+ClassSummary="纳米装甲（也称为纳米肌肉装甲）是一套强大且用途极其广泛的战术战斗装甲。这些套装的硅原纤维肌肉纤维可以编程用于各种目的（例如硬化、肌肉增强或伪装），从而大大增强战斗和身体表现，使操作员能够执行超人的壮举。所有纳米套装都是共生的，这意味着它们与用户物理结合并成为第二层皮肤的一种形式。纳米服和使用者最终融合成一个存在。"
+LeftAbilityTreeTitle="纳米服"
+RightAbilityTreeTitle="猛禽"
+AbilityTreeTitles[0]="纳米服"
+AbilityTreeTitles[1]="狙击手"
+AbilityTreeTitles[2]="枪手"
+AbilityTreeTitles[3]="爆破专家"
+AbilityTreeTitles[4]="重炮手"
+AbilityTreeTitles[5]="侦察员"
+AbilityTreeTitles[6]="刀锋大师"


;ALPHABETICAL ORDER
+RandomNickNames[0]="先知"
+RandomNickNames[1]="游牧民族"
+RandomNickNames[2]="恶魔"
+RandomNickNames[3]="猎人"
+RandomNickNames[4]="心理"
+RandomNickNames[5]="游侠"
+RandomNickNames[6]="零"
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; Ghost CLASS
;************************************************************************************************************
[Ghost_SSV X2SoldierClassTemplate]
+DisplayName="幽灵特工"
+ClassSummary="幽灵是从从婴儿时期就接受训练的具有心理天赋的人中挑选出来的，以引导他们的灵能来增强他们的自然体力和耐力。成功完成幽灵计划的严格训练和增强的应征入伍者随后担任突击队员和刺客。幽灵的渗透和暗杀能力无与伦比。"
+LeftAbilityTreeTitle="幽灵"
+RightAbilityTreeTitle="灵能"
+AbilityTreeTitles[0]="幽灵"
+AbilityTreeTitles[1]="灵能"
+AbilityTreeTitles[2]="狙击手"
+AbilityTreeTitles[3]="枪手"
+AbilityTreeTitles[4]="侦察员"
+AbilityTreeTitles[5]="刀锋大师"


;ALPHABETICAL ORDER
+RandomNickNames[0]="猎人"
+RandomNickNames[1]="死亡枪手"
+RandomNickNames[2]="独奏"
+RandomNickNames[3]="流氓"
+RandomNickNames[4]="死神"
+RandomNickNames[5]="幽灵"
+RandomNickNames[6]="小强"
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]="阿波罗"
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]="女王"
+RandomNickNames_Female[1]="新星"
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; Ninja
;************************************************************************************************************
[Ninja_SSV X2SoldierClassTemplate]
+DisplayName="隼忍"
+ClassSummary="隼忍是精英战士，他们使用他们高度先进的技术和技能来执行间谍、战斗行动和暗杀等任务。他们的训练在生命的早期就开始了，只有在完成如此密集的测试和训练后，他们才能发挥出真正的潜力。所有成员都是具有极高技能和神秘艺术知识的专家。"
+LeftAbilityTreeTitle="隼忍"
+RightAbilityTreeTitle="影子"
+AbilityTreeTitles[0]="忍术"
+AbilityTreeTitles[1]="忍法艺术"
+AbilityTreeTitles[2]="刀锋艺术"
+AbilityTreeTitles[3]="即兴艺术"
+AbilityTreeTitles[4]="效用"

;ALPHABETICAL ORDER
+RandomNickNames[0]="影子"
+RandomNickNames[1]="刺客"
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]="龙"
+RandomNickNames_Male[1]="风"
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]="命运"
+RandomNickNames_Female[1]="杀手"
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""

+RankNames[0]="隼忍招聘"
+RankNames[1]="见习隼忍"
+RankNames[2]="实习隼忍"
+RankNames[3]="普通隼忍"
+RankNames[4]="高深隼忍"
+RankNames[5]="隼忍"
+RankNames[6]="高级隼忍"
+RankNames[7]="史诗级隼忍"
+RankNames[8]="终级隼忍"


+ShortNames[0]="NJR"
+ShortNames[1]="NJA"
+ShortNames[2]="LNJ"
+ShortNames[3]="CNJ"
+ShortNames[4]="ANJ"
+ShortNames[5]="GNJ"
+ShortNames[6]="ENJ"
+ShortNames[7]="MNJ"
+ShortNames[8]="UNJ"


;************************************************************************************************************
; Cyborg CLASS
;************************************************************************************************************
[Cyborg_SSV X2SoldierClassTemplate]
+DisplayName="赛博格"
+ClassSummary="一名生化电子人，更鲜为人知并被称为赛博格，是一种同时具有生物和人工部分的生物。机器部件与假肢不同，因为它们不仅替代了被替换的身体部件，而且还以各种方式增强了它们。赛博格配备了外骨骼 - 全身不可拆卸的电子骨骼 - 具有各种优势。他们的身体配备了一个已安装的战斗能量系统，可以让他们克服战场上的各种情况，但每次任务的可用能量是有限的。"
+LeftAbilityTreeTitle="赛博格"
+RightAbilityTreeTitle="DeusEx"
+AbilityTreeTitles[0]="赛博格"
+AbilityTreeTitles[1]="狙击手"
+AbilityTreeTitles[2]="枪手"
+AbilityTreeTitles[3]="爆破专家"
+AbilityTreeTitles[4]="重炮手"
+AbilityTreeTitles[5]="侦察员"
+AbilityTreeTitles[6]="刀锋大师"
+AbilityTreeTitles[7]="黑客"


;ALPHABETICAL ORDER
+RandomNickNames[0]="狂暴"
+RandomNickNames[1]="Deus-Ex"
+RandomNickNames[2]="金属"
+RandomNickNames[3]="项目"
+RandomNickNames[4]="电缆"
+RandomNickNames[5]="剑圣"
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; N7 Soldier CLASS
;************************************************************************************************************
[N7Soldier_SSV X2SoldierClassTemplate]
+DisplayName="N7星联士兵"
+ClassSummary="这些士兵是联盟中无处不在、无所不能的特种部队，他们在巴西里约热内卢的星际战斗学院接受了训练。他们必须以令人钦佩和有效的方式在战斗情况下生存下来，才能获得 N7 军衔。毁灭者士兵是小队的全能战士，他们的才能专注于提高耐久度和伤害。他们的肾上腺素激增能力极大地提高了他们的战斗力。"
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="士兵"
+AbilityTreeTitles[0]="N7星联士兵"
+AbilityTreeTitles[1]="狙击手"
+AbilityTreeTitles[2]="枪手"
+AbilityTreeTitles[3]="爆破专家"
+AbilityTreeTitles[4]="重炮手"
+AbilityTreeTitles[5]="侦察员"
+AbilityTreeTitles[6]="刀锋大师"
+AbilityTreeTitles[7]="黑客"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; N7 Infiltrator CLASS
;************************************************************************************************************
[N7Infiltrator_SSV X2SoldierClassTemplate]
+DisplayName="N7渗透者"
+ClassSummary="这些士兵是联盟中无处不在、无所不能的特种部队，他们在巴西里约热内卢的星际战斗学院接受了训练。他们必须以令人钦佩和有效的方式在战斗情况下生存下来，才能获得 N7 军衔。渗透者使用植入物来提高敏捷性，使他们在战场上成为滑溜溜的战斗员。他们的战术斗篷是一种非常有价值的工具，可以显着增加他们的暗杀、渗透以及在战场上的生存潜力。"
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="渗透者"
+AbilityTreeTitles[0]="N7渗透者"
+AbilityTreeTitles[1]="狙击手"
+AbilityTreeTitles[2]="枪手"
+AbilityTreeTitles[3]="爆破专家"
+AbilityTreeTitles[4]="重炮手"
+AbilityTreeTitles[5]="侦察员"
+AbilityTreeTitles[6]="刀锋大师"
+AbilityTreeTitles[7]="黑客"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; N7 Engineer CLASS
;************************************************************************************************************
[N7Engineer_SSV X2SoldierClassTemplate]
+DisplayName="N7爆破工程师"
+ClassSummary="这些士兵是联盟中无处不在、无所不能的特种部队，他们在巴西里约热内卢的星际战斗学院接受了训练。他们必须以令人钦佩和有效的方式在战斗情况下生存下来，才能获得 N7 军衔。爆破工程师增加了技术伤害，并获得了源源不断的爆炸手榴弹，以进一步提高他的破坏能力。他能够禁用优先目标，并使用手榴弹进行远程攻击并恐吓战场。"
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="工程师"
+AbilityTreeTitles[0]="N7爆破工程师"
+AbilityTreeTitles[1]="狙击手"
+AbilityTreeTitles[2]="枪手"
+AbilityTreeTitles[3]="爆破专家"
+AbilityTreeTitles[4]="重炮手"
+AbilityTreeTitles[5]="侦察员"
+AbilityTreeTitles[6]="刀锋大师"
+AbilityTreeTitles[7]="黑客"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; N7 Adept CLASS
;************************************************************************************************************
[N7Adept_SSV X2SoldierClassTemplate]
+DisplayName="狂暴强化人"
+ClassSummary="这些士兵是联盟中无处不在、无所不能的特种部队，他们在巴西里约热内卢的星际战斗学院接受了训练。他们必须以令人钦佩和有效的方式在战斗情况下生存下来，才能获得 N7 军衔。狂暴强化人是最终的生物，能够用心灵的力量影响物理世界。专家是质量效应场的耐用且强大的操纵者。他们可以使用生物来暴力操纵环境中的物体，包括附近的敌方目标。"
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="娴熟"
+AbilityTreeTitles[0]="N7生物"
+AbilityTreeTitles[1]="狂暴强化人"
+AbilityTreeTitles[2]="N7先锋生物"
+AbilityTreeTitles[3]="狙击手"
+AbilityTreeTitles[4]="枪手"
+AbilityTreeTitles[5]="爆破专家"
+AbilityTreeTitles[6]="重炮手"
+AbilityTreeTitles[7]="侦察员"
+AbilityTreeTitles[8]="刀锋大师"
+AbilityTreeTitles[9]="黑客"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""

;************************************************************************************************************
; N7 Vanguard CLASS
;************************************************************************************************************
[N7Vanguard_SSV X2SoldierClassTemplate]
+DisplayName="屠戮先锋"
+ClassSummary="这些士兵是联盟中无处不在、无所不能的特种部队，他们在巴西里约热内卢的星际战斗学院接受了训练。他们必须以令人钦佩和有效的方式在战斗情况下生存下来，才能获得 N7 军衔。屠戮先锋是强大的战斗者，能够将娴熟和士兵的进攻能力相结合。他们可以使用各种武器增益以及生物能力。"
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="先锋"
+AbilityTreeTitles[0]="N7生物"
+AbilityTreeTitles[1]="N7 娴熟生物"
+AbilityTreeTitles[2]="屠戮先锋"
+AbilityTreeTitles[3]="狙击手"
+AbilityTreeTitles[4]="枪手"
+AbilityTreeTitles[5]="爆破专家"
+AbilityTreeTitles[6]="重炮手"
+AbilityTreeTitles[7]="侦察员"
+AbilityTreeTitles[8]="刀锋大师"
+AbilityTreeTitles[9]="黑客"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""

;************************************************************************************************************
; N7 Sentinel CLASS
;************************************************************************************************************
[N7Sentinel_SSV X2SoldierClassTemplate]
+DisplayName="N7骑士哨兵"
+ClassSummary="这些士兵是联盟中无处不在、无所不能的特种部队，他们在巴西里约热内卢的星际战斗学院接受了训练。他们必须以令人钦佩和有效的方式在战斗情况下生存下来，才能获得 N7 军衔。N7骑士哨兵携带强大的盾牌上战场以阻挡敌人的火力。圣骑士也把盾牌当作重型近战武器。"
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="哨兵"
+AbilityTreeTitles[0]="N7骑士哨兵"
+AbilityTreeTitles[1]="狙击手"
+AbilityTreeTitles[2]="枪手"
+AbilityTreeTitles[3]="爆破专家"
+AbilityTreeTitles[4]="重炮手"
+AbilityTreeTitles[5]="侦察员"
+AbilityTreeTitles[6]="刀锋大师"
+AbilityTreeTitles[7]="黑客"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""